
-- 건물
INSERT INTO building
(building_name)
VALUES
    ("구미 삼성 청년 아카데미");

-- 층
INSERT INTO floors
(floor_number, map_image_url, building_id)
VALUES
    ("4층", "https://d206-buket.s3.ap-northeast-2.amazonaws.com/3floor_map.png", 1);


-- 시설
INSERT INTO facility
(facility_type, facility_name, facility_left_upx, facility_left_upy, facility_right_downx, facility_right_downy, density_max, hit_count, floors_id)
VALUES
    ("CLASSROOM401", "강의실 401", -1.0,-1.0,-1.0,-1.0, 200, 100, 1),
    ("CLASSROOM402", "강의실 402", -1.0,-1.0,-1.0,-1.0,200, 0, 1),
    ("CLASSROOM403", "강의실 403", -1.0,-1.0,-1.0,-1.0,200, 50, 1),
    ("CLASSROOMBIG", "4층 대강의실", 0.0, 0.0, 15.26, -13.86 ,200, 30, 1),
    ("RESTROOMMAN", "4층 남자 화장실", 23.6, -9.96, 29.23, -14.99, 200, 0, 1),
    ("RESTROOMWOMAN", "4층 여자 화장실", 35.78, -9.96, 41.45, -14.99,200, 20, 1),
    ("BREAKROOM401", "휴게실 401", 16.38, -0.09, 22.52, -5.25 ,200, 0, 1),
    ("BREAKROOM402", "휴게실 402", 22.52, -0.09, 27.71, -5.25 ,200, 0, 1),
    ("BREAKROOM403", "휴게실 403", 27.71, -0.09, 37.33, -5.25 ,200, 0, 1),
    ("STAIRSLEFT", "4층 왼쪽 계단", 21.05, -7.86, 23.45, -13.86, 200, 20, 1),
    ("STAIRSRIGHT", "4층 오른쪽 계단", -1.0, -1.0,-1.0,-1.0, 200, 30, 1),
    ("ELEVATOR", "엘리베이터", 30.9, -8.68, 33.92, -14.99 ,200, 0, 1);


-- 방 입구 좌표
INSERT INTO room_entrance
(entrance_left_upx, entrance_left_upy, entrance_right_downx, entrance_right_downy, entrance_direction, entrance_zone, facility_id)
VALUES
    (15.509, -6.32, 16.009, -8.00, 2, 0.20, 4),
    (27.88, -10.09, 28.38, -10.9, 1, 0.20, 5),
    (36.77, -10.09, 37.27, -10.9, 1, 0.20, 6),
    (21.22, -5.05, 22.62, -6.05, 3, 0.20, 7),
    (27.89, -5.05, 37.39, -6.05, 3, 0.20, 7),
    (24.77, -7.85, 23.77, -8.35, 1, 0.20, 8),
    (31.15, -8.35, 33.75, -8.85, 1, 0.20, 10);



-- 시설에 있는 벽
INSERT INTO block_wall
(block_wall_left_upx, block_wall_left_upy, block_wall_right_downx,block_wall_right_downy, floors_id)
VALUES
    (15.26, -0.47, 16.26, -6.13, 1),
    (15.26, -7.84, 16.26, -14.44, 1),
    (15.51, -5.075, 21.21, -6.125, 1),
    (22.64, -5.075, 24.24, -6.125, 1),
    (24.245, -5.35, 26.875, -5.85, 1),
    (26.87, -5.075, 27.87, -6.125, 1),
    (37.38, -0.47, 37.88, -6.13, 1),
    (16, -7.84, 18.14, -8.35,1),
    (19.16, -7.84, 23.76, -8.35,1),
    (20.01, -7.85, 21.01, -13.85,1),
    (15.72, -13.32, 23.72, -13.82,1),
    (23.3, -9.52, 23.8, -15.52,1),
    (24.78, -7.84, 28.08, -8.35,1),
    (29.14, -8.35, 31.14, -8.35,1),
    (24.79, -8.35, 25.29, -9.55,1),
    (23.81, -9.52, 28.08, -10.02,1),
    (28.13, -10.92, 29.13, -11.42,1),
    (29.16, -9.84, 29.66, -15.84,1),
    (30.64, -8.34, 31.14, -15.34,1),
    (22.82, -15, 42.82, -15.5,1),
    (35.48, -8.34, 35.98, -15.34,1),
    (35.9, -10.92, 36.9, -11.42,1),
    (37.11, -9.55, 40.41, -10.04,1),
    (37.11, -7.85, 40.41, -8.35,1),
    (33.775, -8.35, 36.025, -8.55,1);